[
    {
        "id" : 1,
        "name": "C (programming language)",
        "rating" : "4.5",
        "description" : "C (pronounced like the letter c) is a general-purpose computer programming language. It was created in the 1970s by Dennis Ritchie, and remains very widely used and influential.",
        "detail" : "A successor to the programming language B, C was originally developed at Bell Labs by Ritchie between 1972 and 1973 to construct utilities running on Unix. It was applied to re-implementing the kernel of the Unix operating system.[7] During the 1980s, C gradually gained popularity. It has become one of the most widely used programming languages,[8][9] with C compilers available for almost[citation needed] all modern computer architectures and operating systems. C has been standardized by ANSI since 1989 (ANSI C) and by the International Organization for Standardization (ISO).",
        "image" : "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRX_EKQp3HcXwdnLNTQ-edQIQKY711yysHT1A&usqp=CAU"
    },
   
    {
        "id" : 3,
        "name": "c++ programming",
        "rating" : "4.5",
        "description" : "C++ is a powerful general-purpose programming language. It can be used to develop operating systems, browsers, games, and so on. C++ supports different ways of programming like procedural, object-oriented, functional, and so on. This makes C++ powerful as well as flexible.",
        "detail" : "C++ (pronounced) is a high-level general-purpose programming language created by Danish computer scientist Bjarne Stroustrup as an extension of the C programming language. The language has expanded significantly over time, and modern C++ now has object-oriented, generic, and functional features in addition to facilities for low-level memory manipulation. It is almost always implemented as a compiled language, and many vendors provide C++ compilers, including the Free Software Foundation, LLVM, Microsoft, Intel, Embarcadero, Oracle, and IBM, so it is available on many platforms.",
        "image": "https://studyopedia.com/wp-content/uploads/2017/09/C-Programming.png"
    },
    {
        "id" : 4,
        "name": "python programming",
        "rating" : "5",
        "description" : "Python is a popular programming language. It was created by Guido van Rossum, and released in 1991.",
        "detail" : "In this course, you'll learn the fundamentals of the Python programming language, along with programming best practices. You’ll learn to represent and store data using Python data types and variables, and use conditionals and loops to control the flow of your programs. You’ll harness the power of complex data structures like lists, sets, dictionaries, and tuples to store collections of related data. You’ll define and document your own custom functions, write scripts, and handle errors. Lastly, you’ll learn to find and use modules in the Python Standard Library and other third-party libraries.",
        "image": "https://images.ctfassets.net/mrop88jh71hl/55rrbZfwMaURHZKAUc5oOW/9e5fe805eb03135b82e962e92169ce6d/python-programming-language.png"
    },
    {
        "id" : 5,
        "name": "kotlin programming language",
        "rating" : "5",
        "description" : "Write better Android apps faster with Kotlin. Kotlin is a modern statically typed programming language used by over 60% of professional Android developers that helps boost productivity, developer satisfaction, and code safety.",
        "detail" : "We help you focus on productivity, scalability and reduced-complexity of your Kotlin applications developments.",
        "image": "https://kotlinlang.org/assets/images/twitter/general.png"
    },
    {
        "id" : 6,
        "name": "Swift programming",
        "rating" : "5",
        "description" : "Swift is a powerful and intuitive programming language for iOS, iPadOS, macOS, tvOS, and watchOS. Writing Swift code is interactive and fun, the syntax is concise yet expressive, and Swift includes modern features developers love. Swift code is safe by design and produces software that runs lightning-fast.",
        "detail" : "wift is the result of the latest research on programming languages, combined with decades of experience building Apple platforms. Named parameters are expressed in a clean syntax that makes APIs in Swift even easier to read and maintain. Even better, you don’t even need to type semi-colons. Inferred types make code cleaner and less prone to mistakes, while modules eliminate headers and provide namespaces. To best support international languages and emoji, Strings are Unicode-correct and use a UTF-8 based encoding to optimize performance for a wide-variety of use cases. Memory is managed automatically using tight, deterministic reference counting, keeping memory usage to a minimum without the overhead of garbage collection. You can even write concurrent code with simple, built-in keywords that define asynchronous behavior, making your code more readable and less error-prone.",
        "image": "https://developer.apple.com/swift/images/swift-og.png"
    }
]